uat_chat/Documents/РаботаЗаСмену.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РаботаЗаСмену</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаВодителей</xr:Item>
				<xr:Item>AccumulationRegister.уатРабочееВремяСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяРедакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнфоТабЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КадровыеДанные</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
								<v8:Type>cfg:CatalogRef.уатКлассификаторИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатТарифыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатТарифыСотрудников</Name>
			<Comment>Тарифы сотрудников (уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоОклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифЗП</Name>
					<Comment>Тариф ЗП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТарифныеПланыЗП</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатРегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатРегламентированныйПроизводственныйКалендарь</Name>
			<Comment>Регламентированный производственный календарь (уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Comment>Шестидневка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Comment>Календарные дни</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Comment>Дата календаря</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/РаботаВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РаботаВодителей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасовПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактЧасовПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыДляОборота</Name>
					<Comment>Часы не попадают в табель, нужны чтобы этот вид расчета включался в таблицу оборотов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПутевомуЛисту</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месторождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Месторождения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатРабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатРабочееВремяСотрудников</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Comment>Всегда = 1 (Нужен для выгрузки в ЗУП)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Documents/РаботаЗаСмену/Ext/ObjectModule.bsl
Функция ПЕчДанные()
	
	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботаЗаСменуИсполнители.Ссылка.Номер КАК НомерДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Дата КАК ДатаДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Организация КАК Организация,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Наименование КАК Сотрудник,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Код КАК ТабНом,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Номер КАК НомерРЛ,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Дата КАК ДатаРЛ,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС
	               |	КОНЕЦ КАК ТС,
	               |	ВЫБОР КОГДА РаботаЗаСменуИсполнители.ДокументЛист.Номер IS null ТОгда "" ""
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА ""ПЛ""
	               |		ИНАЧЕ ""РЛ""
	               |	КОНЕЦ КАК ВидДОк,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство.ГаражныйНомер
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС.ГаражныйНомер
	               |	КОНЕЦ КАК ГарНом,
	               |	РаботаЗаСменуИсполнители.ВремяРаботы,
	               |	уатСведенияОСотрудникахСрезПоследних.Должность.Наименование КАК имяДолжность
	               |ИЗ
	               |	Документ.РаботаЗаСмену.Исполнители КАК РаботаЗаСменуИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних КАК уатСведенияОСотрудникахСрезПоследних
	               |		ПО РаботаЗаСменуИсполнители.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	               |ГДЕ
	               |	РаботаЗаСменуИсполнители.Ссылка = &сс";
	Запрос.УстановитьПараметр("сс",Ссылка);			   
	Тбл = Запрос.Выполнить().Выгрузить();
	Тбл.Колонки.Добавить("Должность",Новый ОписаниеТипов("Строка"));
	
	Для каждого стр из Тбл Цикл
		Стр.Должность = Сокрлп(Стр.ИмяДолжность);	
	КонецЦикла;
	
	Возврат Тбл;
	
КонецФункции

Процедура Печать() экспорт
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	Таб.ИмяПараметровПечати = "ПечСписокРРМпо рвепыавилывтдаь";
	
	облШапка = МАкет.ПолучитьОбласть("Шапка");
	облСтрока = МАкет.ПолучитьОбласть("Строка");
	
	ТБл = ПЕчДанные();
	Если Тбл.КОличество()>0 ТОгда
		облШапка.Параметры.Заполнить(ТБл[0]);
	КонецеСЛИ;
	Таб.Вывести(облШапка);

	Ном = 0;
	ДЛЯ каждого стр из Тбл ЦИкл
		Ном= Ном+1;
		облСТрока.Параметры.Ном = Ном;
		облСТрока.Параметры.Заполнить(СТр);
		Таб.Вывести(ОблСтрока);
	КонецЦИкла;
	
	Таб.ПовторятьПриПечатиСтроки = Таб.Область(6,,7);
	
	Таб.ТолькоПросмотр = Истина;
	ТАб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.Показать();
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	| SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Сотрудник Водитель,
	| ISNULL(ПланВР.Ссылка,&ВР) ВидРасчета,
	| НачалоПериода(ТблЗП.Ссылка.Дата,МЕсяц) ПериодРаботы,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	|	cASE WHEN ДокументЛист ССЫЛКА Документ.уатПутевойЛист THEN ДокументЛист.ТранспортноеСредство 
	|		 ELSE ДокументЛист.ТС END КАК ТС,
	| ISNULL(тбСОтр.Тариф,0) Тариф,
	
	| CASE WHEN Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3)) Количество,
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3))*ISNULL(тбСОтр.Тариф,0) Сумма
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| LEFT OUTER JOIN РегистрСведений.уатТарифыСотрудников.СрезПоследних(&Дт,Сотрудник в (&МасСотр) ) тбСотр ON тбСотр.Сотрудник = тблЗП.Сотрудник
	| LEFT OUTER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.КадровыеДанные
	| LEFT OUTER JOIN ПланВидовРасчета.уатОсновныеНачисления ПланВР ON ПланВР.Ссылка = ТБлЗП.КадровыеДанные
	|WHERE тблЗП.ссылка = &сс  
	|    и ТблЗП.ВремяРаботы <> Неопределено
	|    и СпрКЛ.Ссылка IS NULL
	|    и ТблЗП.ВремяРаботы <> ДатаВремя(1,1,1,0,0,0)
	|
	|UNION ALL
	|
	|SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Сотрудник Водитель,
	| тбВР.ССылка ВидРасчета,
	| НачалоПериода(ТблЗП.Ссылка.Дата,МЕсяц) ПериодРаботы,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	|	cASE WHEN ДокументЛист ССЫЛКА Документ.уатПутевойЛист THEN ДокументЛист.ТранспортноеСредство 
	|		 ELSE ДокументЛист.ТС END КАК ТС,
	| тбВР.КоэфНачисления * ISNULL(тбСОтр.Тариф,0) Тариф,
	
	| CASE WHEN Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3)) Количество,
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3))*ISNULL(тбСОтр.Тариф,0) Сумма
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| LEFT OUTER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.ВремяРаботы
	
	|INNER JOIN ПланВидовРасчета.уатОсновныеНачисления тбВР ON тбВР.Ссылка = Значение(ПланВидовРасчета.уатОсновныеНачисления.ДоплатаЗаПраздничныеИВыходные)
	
	|INNER JOIN РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК уатРегламентированныйПроизводственныйКалендарь
	|       ON ДатаКалендаря = &нДт и ВидДня = Значение(Перечисление.уатВидыДнейПроизводственногоКалендаря.Праздник)
	 
	| LEFT OUTER JOIN РегистрСведений.уатТарифыСотрудников.СрезПоследних(&Дт,Сотрудник в (&МасСотр) ) тбСотр ON тбСотр.Сотрудник = тблЗП.Сотрудник
	|WHERE тблЗП.ссылка = &сс  
	|    и ТблЗП.ВремяРаботы <> Неопределено
	|    и СпрКЛ.Ссылка IS NULL
	|    и ТблЗП.ВремяРаботы <> ДатаВремя(1,1,1,0,0,0)
    |    
	|";
	
	запрос.УстановитьПараметр("сс",Ссылка);
	запрос.УстановитьПараметр("ВР",ПланыВидовРасчета.уатОсновныеНачисления.ФиксированнойСуммой);
	запрос.УстановитьПараметр("Дт",КонецДня(Дата));
	запрос.УстановитьПараметр("нДт",НачалоДня(Дата));
	Запрос.УстановитьПараметр("МасСотр",Исполнители.ВыгрузитьКолонку("Сотрудник"));
	
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Рег = Движения.РаботаВодителей;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	
	
	//Кадровые отклонения
	Запрос.Текст = " 
	| SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	| ТблЗП.Сотрудник,
	| ТблЗП.ссылка.Организация Организация,
	| ТБлЗП.КадровыеДанные ВидИспользованияРабочегоВремени,
	| 1 Дней,
	| 28800 Время	
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| INNER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.КадровыеДанные
	|WHERE тблЗП.ссылка = &сс  
	|    
	|";

	Тбл = Запрос.Выполнить().Выгрузить();
	
	Рег = Движения.уатРабочееВремяСотрудников;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	

КонецПроцедуры
